import type { DeepPartial } from "../DeepPartial";
import type { Translation } from "../i18n-types";

const megaphone: DeepPartial<Translation["megaphone"]> = {
    modal: {
        backToSelectCommunication: "กลับไปเลือกการสื่อสาร",
        selectCommunication: "เลือกการสื่อสาร",
        title: "การสื่อสารระดับโลก",
        selectCamera: "เลือกกล้อง 📹",
        selectMicrophone: "เลือกไมโครโฟน 🎙️",
        liveMessage: {
            startMegaphone: "เริ่มเมกะโฟน",
            stopMegaphone: "หยุดเมกะโฟน",
            goingToStream: "คุณกำลังจะสตรีม",
            yourMicrophone: "ไมโครโฟนของคุณ",
            yourCamera: "กล้องของคุณ",
            yourScreen: "หน้าจอของคุณ",
            title: "เมกะโฟน",
            button: "เริ่มข้อความสด",
            and: "และ",
            toAll: "ไปยังผู้เข้าร่วมทั้งหมด",
            confirm: "ยืนยัน",
            cancel: "ยกเลิก",
            notice: `
            ข้อความสดหรือ "เมกะโฟน" ช่วยให้คุณส่งข้อความสดพร้อมกล้องและไมโครโฟนไปยังทุกคนที่เชื่อมต่อในห้องหรือโลก

            ข้อความนี้จะแสดงที่มุมล่างของหน้าจอ เหมือนการโทรผ่านวิดีโอหรือฟองสนทนา

            ตัวอย่างการใช้งาน: "สวัสดีทุกคน เราจะเริ่มการประชุมกันเลยไหม? 🎉 ตามอวตารของฉันไปยังพื้นที่ประชุมและเปิดแอปวิดีโอ 🚀"
            `,
            settings: "ตั้งค่า",
        },
        textMessage: {
            title: "ข้อความข้อความ",
            notice: `
            ข้อความข้อความช่วยให้คุณส่งข้อความไปยังทุกคนที่เชื่อมต่อในห้องหรือโลก

            ข้อความนี้จะแสดงเป็นป๊อปอัปที่ด้านบนของหน้าและจะมีเสียงแจ้งเตือน

            ตัวอย่างข้อความ: "การประชุมในห้อง 3 เริ่มในอีก 2 นาที 🎉 คุณสามารถไปยังพื้นที่ประชุม 3 และเปิดแอปวิดีโอ 🚀"
            `,
            button: "ส่งข้อความข้อความ",
            noAccess: "คุณไม่มีสิทธิ์เข้าถึงฟีเจอร์นี้ 😱 กรุณาติดต่อผู้ดูแลระบบ 🙏",
        },
        audioMessage: {
            title: "ข้อความเสียง",
            notice: `
            ข้อความเสียงเป็นข้อความประเภท "MP3, OGG..." ที่ส่งไปยังผู้ใช้ทั้งหมดที่เชื่อมต่อในห้องหรือในโลก

            ข้อความเสียงนี้จะถูกดาวน์โหลดและเปิดให้ทุกคนที่ได้รับการแจ้งเตือนนี้

            ข้อความเสียงอาจประกอบด้วยการบันทึกเสียงที่แจ้งว่าการประชุมจะเริ่มในไม่กี่นาที
            `,
            button: "ส่งข้อความเสียง",
            noAccess: "คุณไม่มีสิทธิ์เข้าถึงฟีเจอร์นี้ 😱 กรุณาติดต่อผู้ดูแลระบบ 🙏",
        },
    },
};

export default megaphone;
